{
  "aboutMe": "About me",
  "career": "Career",
  "education": "Education",
  "skills": "Skills",

  "careerItems": [
    {
      "title": "Dataport, AöR",
      "subtitle": "since June 2016",
      "keywords": [
        ".NET", "C#", "ASP.NET MVC", "Angular", "TypeScript", "MongoDB", "WPF", "git", "DevOps", "DDD", "TDD", "SCRUM"
      ],
      "content": [
        "Working at Dataport, I especially improved on architectural aspects of software development and applying SOLID principles in practice. By contributing to an internal framework I learned about carefully managing dependencies and using semantic versioning. I was involved in configuration of CI and CD with TFS in multiple projects. I learned a lot about focused development of solutions by applying principles like SCRUM, Domain Driven Design and Test Driven Development.",
        "The projects I worked on dealt with several problems from the domain of public administration and government, like management of areas, administration of schools and support of public projects.",
        "I contributed to solutions developed with Angular + Angular Material in TypeScript, which also includes working with npm, jasmine, karma and also jest. By using MongoDB in a project I was able to gain experience with NoSQL in a real-world project. In addition, I got familiar with several other frameworks and libraries, like WPF, AutoMapper, Ninject and Devexpress, as well as daily use of Resharper and version control with git.",
        "For further education, I took the chance to attend the BASTA! conference in Mainz in 2017 and the Developer Week in Nuremberg in 2018."
      ]
    },

    {
      "title": "NeoGeo New Media GmbH",
      "subtitle": "August 2010 - May 2016",
      "keywords": [
        ".NET", "C#", "ASP.NET MVC", "AngularJS", "Javascript", "Bootstrap", "jQuery", "ASP.NET WebForms"
      ],
      "content": [
        "I have started and concluded my apprenticeship as a developer ('Fachinformatiker - Anwendungsentwicklung') at NeoGeo and continued to work there for three more years to get more experience. I maintained and extended a rich web-based application and also contributed to buildung new projects from scratch.",
        "The projects I worked on dealt with energy management, software-supported team collaboration and financial management with risk analysis.",
        "I contributed to web-based solutions developed with ASP.NET MVC + AngularJS and Bootstrap. I also worked with many other frameworks and libraries, like jQuery + jQuery UI, Entity Framework, WCF and ASP.NET WebForms, as well as Microsoft SQL Server.",
        "In addition, I was able to familiarize with many tools for different problems in the context of real-world applications, like Cordova (formerly known as PhoneGap), Xamarin, Windows Services, WIX and Silverlight."
      ]
    }
  ],

  "educationItems": [
    {
      "title": "Studium: B.Sc. Informatik",
      "subtitle": "Abschluss voraussichtlich 2020",
      "content": [
        "Kurz nach Abschluss meiner Ausbildung habe ich mich dazu entschlossen, ein Teilzeitstudium neben der Arbeit zu beginnen. Aus Interesse an theoretischen Grundlagen mit deren mathematischen Hintergründen habe ich mich für das Studium der Informatik an der FernUniversität in Hagen entschieden."
      ],
      "checklists": [
        {
          "title": "Wahlmodule",
          "items": [
            { "label": "Software Engineering I", "score": "1,7" },
            { "label": "Sicherheit im Internet", "score": "1,7" },
            { "label": "Übersetzerbau", "score": "1,3" },
            { "label": "Moderne Programmiertechniken und - methoden", "score": "[Prüfung am 09.05.2019]" }
          ]
        },

        {
          "title": "Ausstehende Aufgaben",
          "items": [
            { "label": "Seminar: e-Government" },
            { "label": "Anerkennung berufspraktischer Leistungen (Fachpraktikum)" },
            { "label": "Bachelorarbeit" }
          ]
        }
      ]
    },
    
    {
      "title": "Ausbildung: Fachinformatiker - Anwendungsentwicklung",
      "subtitle": "Abschluss 2013",
      "content": [
        "Im Anschluss an die schulische Laufbahn habe ich eine Ausbildung als Fachinformatiker (Fachrichtung Anwendungsentwicklung) bei der NeoGeo New Media GmbH in Elmshorn begonnen. Diese beendete ich im Wintersemester 2012/13 (verkürzt auf 2,5 Jahre) mit Auszeichnung der IHK als Prüfungsbester."
      ]
    },

    {
      "title": "Schulabschluss: Allgemeine Hochschulreife",
      "subtitle": "Abschluss 2010",
      "content": [
        "Meine schulische Laufbahn endete 2010 mit dem Abitur (Abschlussnote 2,0) am Detlefsengymnasium in Glückstadt."
      ]
    }
  ],

  "skillsItems": [
    {
      "level": "Professionelle Erfahrung",
      "text": "In dieser Kategorie sind alle Themen aufgelistet, mit denen ich sehr gut vertraut bin. Dazu zählen Technologien, die ich über lange Zeit hinweg in der regelmäßigen Arbeit praktisch angewandt habe und ebenfalls die theoretischen Hintergründe dazu beherrsche.",
      "keywords": ["C#", ".NET", "ASP.NET MVC", "Entity Framework", "LINQ", "SQL", "ASP.NET WebForms", "TypeScript", "Javascript", "Angular", "Angular Material", "AngularJS", "Bootstrap", "jQuery", "jQuery UI"]
    },
    
    {
      "level": "Nicht-professionelle Erfahrung",
      "text": "In dieser Kategorie sind Themen aufgelistet, mit denen ich mich aus persönlichem Antrieb näher beschäftigt habe und zumindest etwas mehr als Grundkenntnisse besitze.",
      "keywords": ["Android", "Java", "F#", "Chrome Extensions", "Node", "IoT"] 
    }
  ],
  "notableReadingsTitle": "Bedeutendste Fachliteratur",
  "notableReadings": [
    { "title": "CLR via C#", "author": "Jeffrey Richter" },
    { "title": "C# in Depth", "author": "Jon Skeet" },
    { "title": "Real-World functional programming", "author": "Tomas Petricek" },
    { "title": "Adaptive Code via C#", "author": "Gary McLean Hall" },
    { "title": "Clean-Serie (Code, Coder, Architecture)", "author": "Robert C. Martin" }
  ]
}